In [1]:
import pandas as pd

df = pd.read_csv("WA_Fn-UseC_-HR-Employee-Attrition.csv")

print("Loaded")
print("Dataset shape:", df.shape)

df.head()

Loaded
Dataset shape: (1470, 35)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2

In [2]:
len(df)

1470

In [3]:
df["EmployeeNumber"].nunique()

1470

In [4]:
df["Department"].value_counts()

Department
Research & Development    961
Sales                     446
Human Resources            63
Name: count, dtype: int64

In [5]:
df["EmployeeCount"].value_counts()

EmployeeCount
1    1470
Name: count, dtype: int64

In [6]:
df["Gender"].value_counts()

Gender
Male      882
Female    588
Name: count, dtype: int64

In [7]:
df["EducationField"].value_counts()

EducationField
Life Sciences       606
Medical             464
Marketing           159
Technical Degree    132
Other                82
Human Resources      27
Name: count, dtype: int64

In [8]:
df.sort_values("MonthlyIncome", ascending=False).head(10)
df.sort_values("YearsAtCompany").head(10)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
23,21,No,Travel_Rarely,391,Research & Development,15,2,Life Sciences,1,30,...,4,80,0,0,6,3,0,0,0,0
77,45,No,Travel_Rarely,193,Research & Development,6,4,Other,1,101,...,2,80,0,17,3,4,0,0,0,0
1060,24,Yes,Travel_Frequently,381,Research & Development,9,3,Medical,1,1494,...,3,80,0,4,2,2,0,0,0,0
347,47,No,Travel_Frequently,1309,Sales,4,1,Medical,1,467,...,1,80,0,5,3,3,0,0,0,0
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
560,34,No,Travel_Rarely,167,Research & Development,8,5,Life Sciences,1,775,...,3,80,1,7,3,3,0,0,0,0
352,48,No,Travel_Rarely,530,Sales,29,1,Medical,1,473,...,2,80,1,15,3,1,0,0,0,0
862,44,No,Non-Travel,111,Research & Development,17,3,Life Sciences,1,1206,...,4,80,0,6,3,3,0,0,0,0
602,30,No,Travel_Rarely,946,Research & Development,2,3,Medical,1,833,...,2,80,0,12,4,2,0,0,0,0
1202,38,No,Travel_Rarely,1495,Research & Development,4,2,Medical,1,1687,...,4,80,1,7,5,2,0,0,0,0

In [9]:
df.sort_values("YearsAtCompany", ascending=False).head(10)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
126,58,Yes,Travel_Rarely,147,Research & Development,23,4,Medical,1,165,...,4,80,1,40,3,2,40,10,15,6
98,58,No,Travel_Rarely,682,Sales,10,4,Medical,1,131,...,3,80,0,38,1,2,37,10,1,8
1116,55,No,Travel_Rarely,685,Sales,26,5,Marketing,1,1578,...,3,80,1,36,3,3,36,6,2,13
270,55,No,Travel_Rarely,452,Research & Development,1,3,Medical,1,374,...,3,80,0,37,2,3,36,10,4,13
561,52,No,Travel_Rarely,621,Sales,3,4,Marketing,1,776,...,1,80,0,34,3,4,34,6,1,16
914,55,No,Non-Travel,177,Research & Development,8,1,Medical,1,1278,...,4,80,1,34,3,3,33,9,15,0
1111,53,Yes,Travel_Rarely,607,Research & Development,2,5,Technical Degree,1,1572,...,2,80,1,34,4,3,33,7,1,9
962,51,No,Travel_Rarely,770,Human Resources,5,3,Life Sciences,1,1352,...,2,80,1,33,2,3,33,9,0,10
237,52,No,Non-Travel,771,Sales,2,4,Life Sciences,1,329,...,4,80,0,33,2,4,33,7,15,12
190,52,No,Travel_Rarely,699,Research & Development,1,4,Life Sciences,1,259,...,1,80,1,34,5,3,33,18,11,9

In [10]:
df.sort_values("YearsAtCompany").head(10)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
23,21,No,Travel_Rarely,391,Research & Development,15,2,Life Sciences,1,30,...,4,80,0,0,6,3,0,0,0,0
77,45,No,Travel_Rarely,193,Research & Development,6,4,Other,1,101,...,2,80,0,17,3,4,0,0,0,0
1060,24,Yes,Travel_Frequently,381,Research & Development,9,3,Medical,1,1494,...,3,80,0,4,2,2,0,0,0,0
347,47,No,Travel_Frequently,1309,Sales,4,1,Medical,1,467,...,1,80,0,5,3,3,0,0,0,0
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
560,34,No,Travel_Rarely,167,Research & Development,8,5,Life Sciences,1,775,...,3,80,1,7,3,3,0,0,0,0
352,48,No,Travel_Rarely,530,Sales,29,1,Medical,1,473,...,2,80,1,15,3,1,0,0,0,0
862,44,No,Non-Travel,111,Research & Development,17,3,Life Sciences,1,1206,...,4,80,0,6,3,3,0,0,0,0
602,30,No,Travel_Rarely,946,Research & Development,2,3,Medical,1,833,...,2,80,0,12,4,2,0,0,0,0
1202,38,No,Travel_Rarely,1495,Research & Development,4,2,Medical,1,1687,...,4,80,1,7,5,2,0,0,0,0

In [11]:
df.sort_values("YearsAtCompany", ascending=False).head(10)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
126,58,Yes,Travel_Rarely,147,Research & Development,23,4,Medical,1,165,...,4,80,1,40,3,2,40,10,15,6
98,58,No,Travel_Rarely,682,Sales,10,4,Medical,1,131,...,3,80,0,38,1,2,37,10,1,8
1116,55,No,Travel_Rarely,685,Sales,26,5,Marketing,1,1578,...,3,80,1,36,3,3,36,6,2,13
270,55,No,Travel_Rarely,452,Research & Development,1,3,Medical,1,374,...,3,80,0,37,2,3,36,10,4,13
561,52,No,Travel_Rarely,621,Sales,3,4,Marketing,1,776,...,1,80,0,34,3,4,34,6,1,16
914,55,No,Non-Travel,177,Research & Development,8,1,Medical,1,1278,...,4,80,1,34,3,3,33,9,15,0
1111,53,Yes,Travel_Rarely,607,Research & Development,2,5,Technical Degree,1,1572,...,2,80,1,34,4,3,33,7,1,9
962,51,No,Travel_Rarely,770,Human Resources,5,3,Life Sciences,1,1352,...,2,80,1,33,2,3,33,9,0,10
237,52,No,Non-Travel,771,Sales,2,4,Life Sciences,1,329,...,4,80,0,33,2,4,33,7,15,12
190,52,No,Travel_Rarely,699,Research & Development,1,4,Life Sciences,1,259,...,1,80,1,34,5,3,33,18,11,9

In [12]:
df["Attrition"].values_counts()

AttributeError: 'Series' object has no attribute 'values_counts'

In [13]:
df["Attrition"].value_counts()

Attrition
No     1233
Yes     237
Name: count, dtype: int64

In [14]:
df["AgeGroup"] = pd.cut(
    df["Age"],
    bins=[17,25,35,45,55,65],
    
)

df["AgeGroup"].value_counts()

AgeGroup
(25, 35]    606
(35, 45]    468
(45, 55]    226
(17, 25]    123
(55, 65]     47
Name: count, dtype: int64

In [15]:
df["AgeGroup"] = pd.cut(
    df["Age"],
    bins=[17,25,35,45,55,65],
    labels=["18-25","26-35","36-45","46-55","56-65"]
)

df["AgeGroup"].value_counts()

AgeGroup
26-35    606
36-45    468
46-55    226
18-25    123
56-65     47
Name: count, dtype: int64

In [16]:
top10_left = df[df["Attrition"] == "Yes"].sort_values(
    "MonthlyIncome", ascending=False
).head(10)

In [17]:
top10_left = df[df["Attrition"] == "Yes"].sort_values(
    "MonthlyIncome", ascending=False
).head(10)

top10_left[["EmployeeNumber", "Department", "JobRole", "MonthlyIncome", "Attrition"]]

,EmployeeNumber,Department,JobRole,MonthlyIncome,Attrition
568,787,Research & Development,Manager,19859,Yes
749,1038,Sales,Manager,19845,Yes
45,58,Research & Development,Research Director,19545,Yes
595,825,Research & Development,Research Director,19246,Yes
913,1277,Sales,Manager,18824,Yes
838,1167,Sales,Sales Executive,13758,Yes
975,1372,Sales,Sales Executive,13695,Yes
435,582,Research & Development,Manager,13610,Yes
706,986,Sales,Sales Executive,13194,Yes
1223,1716,Sales,Sales Executive,12936,Yes

In [18]:
top10_left = df[df["Attrition"] == "Yes"].sort_values(
    "MonthlyIncome", ascending=False
).head(10)

top10_left[["EmployeeNumber", "Department", "JobRole", "OverTime", "MonthlyIncome", "Attrition"]]

,EmployeeNumber,Department,JobRole,OverTime,MonthlyIncome,Attrition
568,787,Research & Development,Manager,Yes,19859,Yes
749,1038,Sales,Manager,No,19845,Yes
45,58,Research & Development,Research Director,No,19545,Yes
595,825,Research & Development,Research Director,Yes,19246,Yes
913,1277,Sales,Manager,Yes,18824,Yes
838,1167,Sales,Sales Executive,Yes,13758,Yes
975,1372,Sales,Sales Executive,Yes,13695,Yes
435,582,Research & Development,Manager,Yes,13610,Yes
706,986,Sales,Sales Executive,Yes,13194,Yes
1223,1716,Sales,Sales Executive,No,12936,Yes

In [19]:
df["OverTime"].value_counts()

OverTime
No     1054
Yes     416
Name: count, dtype: int64

In [20]:
top10_left = df[df["PerformanceRating"]].sort_values(
    "MonthlyIncome", ascending=False
).head(10)

top10_left[["EmployeeNumber", "Department", "JobRole", "OverTime", "MonthlyIncome", "Attrition"]]

KeyError: "None of [Index([3, 4, 3, 3, 3, 3, 4, 4, 4, 3,\n       ...\n       3, 3, 3, 3, 3, 3, 3, 4, 3, 3],\n      dtype='int64', length=1470)] are in the [columns]"

In [21]:
top10_left = df[df["PerformanceRating"]].sort_values(
    "MonthlyIncome", ascending=False
).head(10)

top10_left[["EmployeeNumber", "Department", "JobRole", "OverTime", "MonthlyIncome", "PerformanceRating"]]

KeyError: "None of [Index([3, 4, 3, 3, 3, 3, 4, 4, 4, 3,\n       ...\n       3, 3, 3, 3, 3, 3, 3, 4, 3, 3],\n      dtype='int64', length=1470)] are in the [columns]"

In [22]:
top10_perf = df[df["PerformanceRating"] == 4].sort_values(
    "MonthlyIncome", ascending=False
).head(10)

top10_perf[["EmployeeNumber", "Department", "JobRole", "OverTime", "MonthlyIncome", "PerformanceRating"]]

,EmployeeNumber,Department,JobRole,OverTime,MonthlyIncome,PerformanceRating
746,1035,Research & Development,Research Director,No,19973,4
918,1282,Sales,Manager,Yes,19847,4
1009,1423,Research & Development,Research Director,Yes,19701,4
1129,1595,Research & Development,Manager,No,19613,4
1116,1578,Sales,Manager,No,19586,4
105,140,Human Resources,Manager,No,18844,4
936,1306,Research & Development,Manager,No,18061,4
867,1215,Research & Development,Manager,No,17856,4
1185,1666,Research & Development,Research Director,No,17603,4
1184,1665,Research & Development,Manager,No,17426,4

In [23]:
df.sort_values("MonthlyIncome", ascending=False).head(40)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager,AgeGroup
190,52,No,Travel_Rarely,699,Research & Development,1,4,Life Sciences,1,259,...,80,1,34,5,3,33,18,11,9,46-55
746,41,No,Non-Travel,247,Research & Development,7,1,Life Sciences,1,1035,...,80,2,21,3,3,21,16,5,10,36-45
851,56,No,Travel_Rarely,718,Research & Development,4,4,Technical Degree,1,1191,...,80,1,28,2,3,5,2,4,2,56-65
165,50,No,Travel_Rarely,1452,Research & Development,11,3,Life Sciences,1,226,...,80,0,21,5,3,5,4,4,4,46-55
568,55,Yes,Travel_Rarely,725,Research & Development,2,3,Medical,1,787,...,80,1,24,2,3,5,2,1,4,46-55
918,51,No,Travel_Frequently,237,Sales,9,3,Life Sciences,1,1282,...,80,1,31,5,2,29,10,11,10,46-55
749,52,Yes,Travel_Rarely,266,Sales,2,1,Marketing,1,1038,...,80,1,33,3,3,32,14,6,9,46-55
1242,40,No,Travel_Rarely,611,Sales,7,4,Medical,1,1740,...,80,0,21,3,2,21,8,12,8,36-45
898,43,No,Travel_Rarely,920,Research & Development,3,3,Life Sciences,1,1255,...,80,1,25,2,3,8,7,0,7,36-45
956,56,No,Travel_Rarely,206,Human Resources,8,4,Life Sciences,1,1338,...,80,0,36,4,3,7,3,7,7,56-65
1009,58,No,Travel_Rarely,1055,Research & Development,1,3,Medical,1,1423,...,80,1,32,3,3,9,8,1,5,56-65
1331,48,No,Travel_Rarely,1224,Research & Development,10,3,Life Sciences,1,1867,...,80,0,29,3,3,22,10,12,9,46-55
1154,47,No,Travel_Rarely,1176,Human Resources,26,4,Life Sciences,1,1625,...,80,1,27,2,3,5,2,1,0,46-55
1401,55,No,Travel_Rarely,189,Human Resources,26,4,Human Resources,1,1973,...,80,1,35,0,3,10,9,1,4,46-55
770,46,No,Travel_Rarely,430,Research & Development,1,4,Medical,1,1069,...,80,2,23,0,3,2,2,2,2,46-55
814,40,No,Travel_Rarely,1308,Research & Development,14,3,Medical,1,1128,...,80,0,21,2,4,20,7,4,9,36-45
1129,42,No,Travel_Rarely,1059,Research & Development,9,2,Other,1,1595,...,80,0,24,2,3,1,0,0,1,36-45
1116,55,No,Travel_Rarely,685,Sales,26,5,Marketing,1,1578,...,80,1,36,3,3,36,6,2,13,46-55
411,60,No,Travel_Rarely,422,Research & Development,7,3,Life Sciences,1,549,...,80,0,33,5,1,29,8,11,10,56-65
45,41,Yes,Travel_Rarely,1360,Research & Development,12,3,Technical Degree,1,58,...,80,0,23,0,3,22,15,15,8,36-45
123,51,No,Travel_Rarely,684,Research & Development,6,3,Life Sciences,1,162,...,80,0,23,5,3,20,18,15,15,46-55
233,50,No,Travel_Rarely,854,Sales,1,4,Medical,1,323,...,80,1,32,3,2,7,0,0,6,46-55
497,44,No,Travel_Rarely,1315,Research & Development,3,4,Other,1,671,...,80,1,26,2,4,2,2,0,1,36-45
473,49,No,Travel_Rarely,1245,Research & Development,18,4,Life Sciences,1,638,...,80,1,31,5,3,31,9,0,9,46-55
257,40,No,Travel_Rarely,1416,Research & Development,2,2,Medical,1,352,...,80,1,22,5,3,21,7,3,9,36-45
1437,39,No,Non-Travel,105,Research & Development,9,3,Life Sciences,1,2022,...,80,0,21,3,2,6,0,1,3,36-45
716,41,No,Travel_Frequently,840,Research & Development,9,3,Medical,1,999,...,80,1,21,2,4,18,16,0,11,36-45
392,54,No,Travel_Rarely,821,Research & Development,5,2,Medical,1,522,...,80,1,24,4,2,4,2,1,2,46-55
1330,43,No,Travel_Rarely,823,Research & Development,6,3,Medical,1,1866,...,80,0,21,2,3,16,12,6,14,36-45
1126,50,No,Travel_Rarely,264,Sales,9,3,Marketing,1,1591,...,80,1,27,2,3,1,0,0,0,46-55
1277,46,No,Travel_Rarely,734,Research & Development,2,4,Medical,1,1789,...,80,1,24,3,3,2,1,2,2,46-55
326,39,No,Travel_Frequently,672,Research & Development,7,2,Medical,1,444,...,80,1,21,2,3,21,9,13,3,36-45
595,58,Yes,Travel_Rarely,286,Research & Development,2,4,Life Sciences,1,825,...,80,0,40,2,3,31,15,13,8,56-65
766,50,No,Travel_Rarely,1464,Research & Development,2,4,Medical,1,1061,...,80,1,29,2,2,8,1,7,7,46-55
231,42,No,Travel_Rarely,532,Research & Development,4,2,Technical Degree,1,319,...,80,0,22,3,3,22,17,11,15,36-45
244,45,No,Travel_Rarely,252,Research & Development,1,3,Other,1,336,...,80,1,25,2,3,24,0,1,7,36-45
400,39,No,Travel_Frequently,1218,Research & Development,1,1,Life Sciences,1,531,...,80,1,21,3,3,21,8,1,6,36-45
922,44,No,Travel_Rarely,1199,Research & Development,4,2,Life Sciences,1,1288,...,80,2,26,4,2,25,9,14,13,36-45
538,41,No,Travel_Rarely,314,Human Resources,1,3,Human Resources,1,734,...,80,1,22,3,3,22,7,2,10,36-45
955,55,No,Travel_Rarely,282,Research & Development,2,2,Medical,1,1336,...,80,1,23,5,3,19,9,9,11,46-55

In [28]:
df.sort_values("MonthlyIncome", ascending=False)[["MonthlyIncome", "TotalWorkingYears"]].head(40)

      MonthlyIncome  TotalWorkingYears
190           19999                 34
746           19973                 21
851           19943                 28
165           19926                 21
568           19859                 24
918           19847                 31
749           19845                 33
1242          19833                 21
898           19740                 25
956           19717                 36
1009          19701                 32
1331          19665                 29
1154          19658                 27
1401          19636                 35
770           19627                 23
814           19626                 21
1129          19613                 24
1116          19586                 36
411           19566                 33
45            19545                 23
123           19537                 23
233           19517                 32
497           19513                 26
473           19502                 31
257           19436                 22
1437          19431                 21
716           19419                 21
392           19406                 24
1330          19392                 21
1126          19331                 27
1277          19328                 24
326           19272                 21
595           19246                 40
766           19237                 29
231           19232                 22
244           19202                 25
400           19197                 21
922           19190                 26
538           19189                 22
955           19187                 23

In [26]:
df.sort_values("MonthlyIncome", ascending=False)[["MonthlyIncome"]].head(40).tolist()

AttributeError: 'DataFrame' object has no attribute 'tolist'

In [27]:
df.sort_values("MonthlyIncome", ascending=False)["MonthlyIncome"].head(40).tolist()

[19999,
 19973,
 19943,
 19926,
 19859,
 19847,
 19845,
 19833,
 19740,
 19717,
 19701,
 19665,
 19658,
 19636,
 19627,
 19626,
 19613,
 19586,
 19566,
 19545,
 19537,
 19517,
 19513,
 19502,
 19436,
 19431,
 19419,
 19406,
 19392,
 19331,
 19328,
 19272,
 19246,
 19237,
 19232,
 19202,
 19197,
 19190,
 19189,
 19187]

In [29]:
df.sort_values("TotalWorkingYears", ascending=False)[["TotalWorkingYears"]].head(40)

      TotalWorkingYears
126                  40
595                  40
98                   38
270                  37
445                  37
1301                 37
85                   37
956                  36
187                  36
1116                 36
1184                 36
401                  36
894                  36
1043                 35
1401                 35
624                  35
1264                 34
1111                 34
190                  34
914                  34
561                  34
962                  33
411                  33
890                  33
749                  33
649                  33
237                  33
976                  33
424                  32
477                  32
867                  32
233                  32
714                  32
1009                 32
1138                 32
1086                 32
534                  32
408                  31
1010                 31
473                  31

In [30]:
df["TotalWorkingYears"].value_counts()

TotalWorkingYears
10    202
6     125
8     103
9      96
5      88
7      81
1      81
4      63
12     48
3      42
15     40
16     37
11     36
13     36
21     34
17     33
14     31
2      31
20     30
18     27
19     22
23     22
22     21
24     18
26     14
25     14
28     14
0      11
29     10
31      9
32      9
30      7
33      7
27      7
36      6
34      5
37      4
35      3
40      2
38      1
Name: count, dtype: int64

In [33]:
df[df["TotalWorkingYears"] == 40]["Department"]

126    Research & Development
595    Research & Development
Name: Department, dtype: object

In [34]:
df["TotalWorkingYears"] == 40

0       False
1       False
2       False
3       False
4       False
        ...
1465    False
1466    False
1467    False
1468    False
1469    False
Name: TotalWorkingYears, Length: 1470, dtype: bool

In [35]:
import sqlite3
import pandas as pd

# Create/connect to a local SQLite database file
conn = sqlite3.connect("hr.db")

# Insert the DataFrame into a SQL table called 'employees'
df.to_sql("employees", conn, if_exists="replace", index=False)

# Quick check: count rows inside the SQL table
pd.read_sql_query("SELECT COUNT(*) AS rows_in_db FROM employees;", conn)

   rows_in_db
0        1470

In [36]:
pd.read_sql_query("""
SELECT Department, COUNT(*) AS Employees
FROM employees
GROUP BY Department
ORDER BY Employees DESC;
""", conn)

               Department  Employees
0  Research & Development        961
1                   Sales        446
2         Human Resources         63

In [40]:
pd.read_sql_query("""
SELECT
  Attrition,
  COUNT(*) AS Employees,
  ROUND(100.0 * COUNT(*) / (SELECT COUNT(*) FROM employees), 2) AS Percentage
FROM employees
GROUP BY Attrition;
""", conn)

  Attrition  Employees  Percentage
0        No       1233       83.88
1       Yes        237       16.12

In [41]:
pd.read_sql_query("""
SELECT
  Department,
  ROUND(AVG(MonthlyIncome), 2) AS AvgMonthlyIncome
FROM employees
GROUP BY Department
ORDER BY AvgMonthlyIncome DESC;
""", conn)

               Department  AvgMonthlyIncome
0                   Sales           6959.17
1         Human Resources           6654.51
2  Research & Development           6281.25

In [42]:
import sqlite3
conn = sqlite3.connect("hr.db")

In [43]:
df["Department"].value_counts()

Department
Research & Development    961
Sales                     446
Human Resources            63
Name: count, dtype: int64

In [45]:
df["EmployeeNumber"].nunique()

1470

In [46]:
df["JobRole"].value_counts()

JobRole
Sales Executive              326
Research Scientist           292
Laboratory Technician        259
Manufacturing Director       145
Healthcare Representative    131
Manager                      102
Sales Representative          83
Research Director             80
Human Resources               52
Name: count, dtype: int64

In [52]:
df.groupby("JobRole")["MonthlyIncome"].mean().round(2).sort_values(ascending=False)

JobRole
Manager                      17181.68
Research Director            16033.55
Healthcare Representative     7528.76
Manufacturing Director        7295.14
Sales Executive               6924.28
Human Resources               4235.75
Research Scientist            3239.97
Laboratory Technician         3237.17
Sales Representative          2626.00
Name: MonthlyIncome, dtype: float64

In [49]:
pd.read_sql_query("""
SELECT
    JobRole,
    ROUND(AVG(MonthlyIncome), 2) AS AvgMonthlyIncome
FROM employees
GROUP BY JobRole
ORDER BY AvgMonthlyIncome DESC;
""", conn)

                     JobRole  AvgMonthlyIncome
0                    Manager          17181.68
1          Research Director          16033.55
2  Healthcare Representative           7528.76
3     Manufacturing Director           7295.14
4            Sales Executive           6924.28
5            Human Resources           4235.75
6         Research Scientist           3239.97
7      Laboratory Technician           3237.17
8       Sales Representative           2626.00

In [55]:
top5_perf = df[df["PerformanceRating"] == 4].sort_values(
    "MonthlyIncome", ascending=False
).head(5)

top5_perf[["EmployeeNumber", "MonthlyIncome", "PerformanceRating"]]

      EmployeeNumber  MonthlyIncome  PerformanceRating
746             1035          19973                  4
918             1282          19847                  4
1009            1423          19701                  4
1129            1595          19613                  4
1116            1578          19586                  4

In [56]:
pd.read_sql_query("""
SELECT
    EmployeeNumber,
    MonthlyIncome,
    PerformanceRating
FROM employees
WHERE PerformanceRating = 4
ORDER BY MonthlyIncome DESC
LIMIT 5;
""", conn)

   EmployeeNumber  MonthlyIncome  PerformanceRating
0            1035          19973                  4
1            1282          19847                  4
2            1423          19701                  4
3            1595          19613                  4
4            1578          19586                  4

In [57]:
df.groupby("Department")["PerformanceRating"].mean().sort_values(ascending=False)

Department
Research & Development    3.162331
Human Resources           3.142857
Sales                     3.136771
Name: PerformanceRating, dtype: float64

In [59]:
pd.read_sql_query("""
SELECT
    Department,
    AVG(PerformanceRating) AS AvgPerformanceRating
FROM employees
GROUP BY Department
ORDER BY AvgPerformanceRating DESC;
""", conn)

               Department  AvgPerformanceRating
0  Research & Development              3.162331
1         Human Resources              3.142857
2                   Sales              3.136771

In [1]:
total = len(df)
yes = (df["Attrition"] == "Yes").sum()
percent = round(100 * yes / total, 2)
total, yes, percent

NameError: name 'df' is not defined

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("WA_Fn-UseC_-HR-Employee-Attrition.csv")

In [4]:
total = len(df)
yes = (df["Attrition"] == "Yes").sum()
percent = round(100 * yes / total, 2)

total, yes, percent

(1470, np.int64(237), np.float64(16.12))